In [1]:
import pandas as pd

# PANDA DATA

### Create Data

In [2]:
data = {
    'Name':['Pandy','Sandy','Randy','Mandy','Candy','Landy'],
    'Age':[6,7,4,5,4,2],
    'Bamboo Stick': [10,15,20,25,30,35]
}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### shape

In [5]:
df.shape

(6, 3)

### info

In [6]:
df.info

<bound method DataFrame.info of     Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35>

### Head (first five rows)

In [7]:
df.head()

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30

In [8]:
df.head(2)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15

### Tail (last five rows)

In [9]:
df.tail()

    Name  Age  Bamboo Stick
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [10]:
df.tail(3)

    Name  Age  Bamboo Stick
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### Filtering

In [11]:
df[['Name']]

    Name
0  Pandy
1  Sandy
2  Randy
3  Mandy
4  Candy
5  Landy

#### Logical

In [12]:
filter_panda=df[df['Age']<5]

In [13]:
filter_panda  #renaming helps to keep the original data

    Name  Age  Bamboo Stick
2  Randy    4            20
4  Candy    4            30
5  Landy    2            35

df[df['Age']<5] 
df, data frame name used for filtering
[df['Age']<5] is the logic

#### Multiple Filtering

In [14]:
df[['Bamboo Stick','Age']]

   Bamboo Stick  Age
0            10    6
1            15    7
2            20    4
3            25    5
4            30    4
5            35    2

#### Multiple Logic

In [15]:
df[ (df['Age']>4) & (df['Bamboo Stick']>10) ]

    Name  Age  Bamboo Stick
1  Sandy    7            15
3  Mandy    5            25

### Add Column

In [16]:
df['Place']=['Greenland', 'Siberia', 'Antartica','Greenland', 'Siberia', 'Antartica']

In [17]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### Drop Duplicate

In [18]:
df.drop_duplicates(subset=['Place'])

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [19]:
df.drop_duplicates(subset=['Place'],keep='first' )

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [20]:
df.drop_duplicates(subset=['Place'],keep='last' )

    Name  Age  Bamboo Stick      Place
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### Vlaue Counts

In [21]:
df['Place'].value_counts()

Place
Greenland    2
Siberia      2
Antartica    2
Name: count, dtype: int64

In [22]:
df['Age'].value_counts()

Age
4    2
6    1
7    1
5    1
2    1
Name: count, dtype: int64

### Transpose

In [23]:
df.T

                      0        1          2          3        4          5
Name              Pandy    Sandy      Randy      Mandy    Candy      Landy
Age                   6        7          4          5        4          2
Bamboo Stick         10       15         20         25       30         35
Place         Greenland  Siberia  Antartica  Greenland  Siberia  Antartica

### Update (loc)

In [24]:
df.loc[df['Name']== 'Pandy', 'Age']=6

In [25]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

df.loc is the function name, df is the name of the dataframe
[df['Name']== 'Pandy', 'Age'] tracks row location
['Name']== 'Pandy' Row information
=6 is the updated value

#### Delete one Column

In [26]:
df.drop('Place',axis=1)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [27]:
#### Delete multiple Column

In [28]:
#df.drop(['Place','Bamboo Stick'],axis=1)

#### Delete Row

In [29]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

In [30]:
 df.drop(df[df['Name'] == 'Candy'].index)

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
5  Landy    2            35  Antartica

‚úÖ df[df['Name'] == 'Sandy'].index gives you the actual row index/indices where Name == 'Sandy'.
üîç .index in pandas is used to access the row labels (i.e., the indices) of a DataFrame or Series.

In [31]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### iloc

### show row data

In [32]:
df.iloc[2]

Name                Randy
Age                     4
Bamboo Stick           20
Place           Antartica
Name: 2, dtype: object

In [33]:
df.iloc[:3]

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [34]:
df.iloc[1:3]

    Name  Age  Bamboo Stick      Place
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

### show coulmn data

In [35]:
df ['Place']

0    Greenland
1      Siberia
2    Antartica
3    Greenland
4      Siberia
5    Antartica
Name: Place, dtype: object

#### row and column

In [36]:
df.iloc [0:2,1:3]

   Age  Bamboo Stick
0    6            10
1    7            15

###  New index

In [37]:
import pandas as pd

df = pd.DataFrame(
    {
        'Name': ['Pandy', 'Sandy', 'Randy', 'Mandy', 'Candy', 'Landy'],
        'Age': [6, 7, 4, 5, 4, 2],
        'Bamboo Stick': [10, 15, 20, 25, 30, 35]
    },
    index=['a', 'b', 'c', 'd', 'e', 'f']
)

In [38]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

### loc

#### column

In [39]:
df.loc['b']

Name            Sandy
Age                 7
Bamboo Stick       15
Name: b, dtype: object

#### both row & column

In [40]:
df.loc[['b','c'], ['Name','Age']]

    Name  Age
b  Sandy    7
c  Randy    4

### Conevrt to csv

In [41]:
df.to_csv('panda.csv')

We would see a csv file on the local folder

#### No index

In [42]:
df.to_csv('noIndex_panda.csv', index=False)

In [43]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

### Statistical Analysis

In [44]:
df.describe()

            Age  Bamboo Stick
count  6.000000      6.000000
mean   4.666667     22.500000
std    1.751190      9.354143
min    2.000000     10.000000
25%    4.000000     16.250000
50%    4.500000     22.500000
75%    5.750000     28.750000
max    7.000000     35.000000

# EXERCISE SESSION

### Json

In [45]:
df_json=pd.read_json('test.json')

In [46]:
df_json

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [47]:
df_json.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406

### shape

In [48]:
df_json.shape

(6, 4)

### Read CSV

In [49]:
df_json.to_csv("test_excel.csv",index=False)

In [50]:
df_csv=pd.read_csv("test_excel.csv")

In [51]:
df_csv

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

### excel convert

In [52]:
df_excel=df_csv.drop('Calories',axis=1)

In [53]:
df_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

pip install openpyxl

In [54]:
df_excel.to_excel("output.xlsx",index=False)

In [55]:
df_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

### Read Excel

In [56]:
read_excel=pd.read_excel("output.xlsx")

In [57]:
#read_excel=pd.read_excel("output.xlsx",sheet_name='Sheet1')

In [58]:
read_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

###  Data Merge

In [59]:
left= pd.DataFrame({
    'ID': [1,2,3],
    'Name': ['Pandy', 'Mandy',' Sandy']
})
right= pd.DataFrame({
    'ID': [1,2,4],
    'Hobby': ['Eating', 'Dancing',' Sleeping']
})

In [60]:
merged_df=pd.merge(left,right, on='ID', how='inner')

In [61]:
merged_df

   ID   Name    Hobby
0   1  Pandy   Eating
1   2  Mandy  Dancing

### concat

### row

In [62]:
concat_df=pd.concat([left,right],ignore_index=True) #ignore index helps to prevent overflow of index

In [63]:
concat_df

   ID    Name      Hobby
0   1   Pandy        NaN
1   2   Mandy        NaN
2   3   Sandy        NaN
3   1     NaN     Eating
4   2     NaN    Dancing
5   4     NaN   Sleeping

### coulmn

In [64]:
concat_df=pd.concat([left,right],axis=1)

In [65]:
concat_df

   ID    Name  ID      Hobby
0   1   Pandy   1     Eating
1   2   Mandy   2    Dancing
2   3   Sandy   4   Sleeping

#  NUMERICAL RANDOM DATA

### Series

In [66]:
import numpy as np

In [67]:
ser = pd.Series(np.random.rand(34))

In [68]:
ser

0     0.849632
1     0.864233
2     0.232992
3     0.220265
4     0.319813
5     0.817220
6     0.492895
7     0.484170
8     0.339670
9     0.349997
10    0.183782
11    0.361947
12    0.306774
13    0.855649
14    0.017279
15    0.476315
16    0.466272
17    0.297262
18    0.270689
19    0.986273
20    0.345411
21    0.254379
22    0.222616
23    0.108414
24    0.988918
25    0.552145
26    0.332408
27    0.011880
28    0.375569
29    0.511309
30    0.923362
31    0.493675
32    0.929270
33    0.609728
dtype: float64

In [69]:
type(ser)

pandas.core.series.Series

### Data Frame

In [70]:
newdf = pd.DataFrame(np.random.rand(334,5))

In [71]:
newdf

            0         1         2         3         4
0    0.527631  0.429092  0.232090  0.741093  0.937383
1    0.636494  0.611352  0.270255  0.914422  0.710700
2    0.130680  0.402919  0.432941  0.240738  0.902880
3    0.863497  0.237349  0.741376  0.284620  0.929973
4    0.710130  0.439519  0.677275  0.170521  0.932512
..        ...       ...       ...       ...       ...
329  0.677052  0.118715  0.586315  0.094576  0.869839
330  0.011355  0.712154  0.697165  0.832238  0.289677
331  0.845276  0.256460  0.344771  0.831706  0.622861
332  0.595383  0.462823  0.122627  0.026649  0.453852
333  0.696917  0.734185  0.472712  0.762886  0.379400

[334 rows x 5 columns]

In [72]:
type(newdf)

pandas.core.frame.DataFrame

In [73]:
newdf.index

RangeIndex(start=0, stop=334, step=1)

In [74]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

### Convert to Numpy

In [75]:
newdf.to_numpy()

array([[0.52763116, 0.42909152, 0.23208957, 0.74109333, 0.93738284],
       [0.63649373, 0.61135185, 0.27025512, 0.91442175, 0.71070029],
       [0.13067961, 0.40291898, 0.43294149, 0.24073757, 0.90288039],
       ...,
       [0.8452759 , 0.25645983, 0.34477142, 0.83170598, 0.62286078],
       [0.59538308, 0.46282315, 0.12262728, 0.02664949, 0.45385244],
       [0.69691665, 0.73418519, 0.47271182, 0.76288554, 0.37940023]],
      shape=(334, 5))

In [76]:
newdf.head()

          0         1         2         3         4
0  0.527631  0.429092  0.232090  0.741093  0.937383
1  0.636494  0.611352  0.270255  0.914422  0.710700
2  0.130680  0.402919  0.432941  0.240738  0.902880
3  0.863497  0.237349  0.741376  0.284620  0.929973
4  0.710130  0.439519  0.677275  0.170521  0.932512

### Sort

In [77]:
sortdf = pd.DataFrame(np.random.randint(0,50,size=(334,5)))

In [78]:
sortdf

      0   1   2   3   4
0    44  37  19  33  25
1     3   2  14   2  44
2    28  45  44  16  23
3     0  36  16  17  16
4    28  28  44  27  21
..   ..  ..  ..  ..  ..
329  30  41  33  28  46
330  28  43  14   2  40
331  29  49  30  44   7
332  24  26  49  26  20
333  47  33  46  15  43

[334 rows x 5 columns]

In [79]:
sortdf.head()

    0   1   2   3   4
0  44  37  19  33  25
1   3   2  14   2  44
2  28  45  44  16  23
3   0  36  16  17  16
4  28  28  44  27  21

In [80]:
sortdf.sort_index(axis=1,ascending=False) # To Column

      4   3   2   1   0
0    25  33  19  37  44
1    44   2  14   2   3
2    23  16  44  45  28
3    16  17  16  36   0
4    21  27  44  28  28
..   ..  ..  ..  ..  ..
329  46  28  33  41  30
330  40   2  14  43  28
331   7  44  30  49  29
332  20  26  49  26  24
333  43  15  46  33  47

[334 rows x 5 columns]

In [81]:
sortdf.sort_index(axis=0,ascending=False) # To Row

      0   1   2   3   4
333  47  33  46  15  43
332  24  26  49  26  20
331  29  49  30  44   7
330  28  43  14   2  40
329  30  41  33  28  46
..   ..  ..  ..  ..  ..
4    28  28  44  27  21
3     0  36  16  17  16
2    28  45  44  16  23
1     3   2  14   2  44
0    44  37  19  33  25

[334 rows x 5 columns]

In [82]:
type(sortdf)

pandas.core.frame.DataFrame

In [83]:
type(sortdf[0])

pandas.core.series.Series

### Update Value (loc)

In [84]:
sortdf.loc[0,0]=654

In [85]:
sortdf

       0   1   2   3   4
0    654  37  19  33  25
1      3   2  14   2  44
2     28  45  44  16  23
3      0  36  16  17  16
4     28  28  44  27  21
..   ...  ..  ..  ..  ..
329   30  41  33  28  46
330   28  43  14   2  40
331   29  49  30  44   7
332   24  26  49  26  20
333   47  33  46  15  43

[334 rows x 5 columns]

In [86]:
sortdf.columns=list("ABCDE")

In [87]:
sortdf

       A   B   C   D   E
0    654  37  19  33  25
1      3   2  14   2  44
2     28  45  44  16  23
3      0  36  16  17  16
4     28  28  44  27  21
..   ...  ..  ..  ..  ..
329   30  41  33  28  46
330   28  43  14   2  40
331   29  49  30  44   7
332   24  26  49  26  20
333   47  33  46  15  43

[334 rows x 5 columns]

In [88]:
sortdf.loc[0,'B']=774

In [89]:
sortdf

       A    B   C   D   E
0    654  774  19  33  25
1      3    2  14   2  44
2     28   45  44  16  23
3      0   36  16  17  16
4     28   28  44  27  21
..   ...  ...  ..  ..  ..
329   30   41  33  28  46
330   28   43  14   2  40
331   29   49  30  44   7
332   24   26  49  26  20
333   47   33  46  15  43

[334 rows x 5 columns]

In [90]:
sortdf.loc[:,:] # to see all the row and column values

       A    B   C   D   E
0    654  774  19  33  25
1      3    2  14   2  44
2     28   45  44  16  23
3      0   36  16  17  16
4     28   28  44  27  21
..   ...  ...  ..  ..  ..
329   30   41  33  28  46
330   28   43  14   2  40
331   29   49  30  44   7
332   24   26  49  26  20
333   47   33  46  15  43

[334 rows x 5 columns]

### Single Condition

In [91]:
sortdf.loc[(sortdf['A']>48)]

       A    B   C   D   E
0    654  774  19  33  25
22    49   21  37  16  48
71    49   41  29  47  26
95    49   22   5  48  37
141   49   25   9  23  41
151   49   40  37  32  28
156   49   38   6  33   2
183   49    3   9   2  38
226   49   46   6  42  39
240   49   19  10  24   3
277   49   13  14  27  15

### Multiple Condition

In [92]:
sortdf.loc[(sortdf['A']>48) & (sortdf['C']>40)]

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

### iloc

In [93]:
sortdf.iloc[0,4]

np.int32(25)

In [94]:
newdf.iloc[[0,225],[0,2]]

            0         2
0    0.527631  0.232090
225  0.659475  0.808309

| Feature                | `.loc`                                                             | `.iloc`                                                                 |
| ---------------------- | ------------------------------------------------------------------ | ----------------------------------------------------------------------- |
| **Type of indexing**   | **Label-based** ‚Üí You select rows/columns by their names (labels). | **Integer-based** ‚Üí You select rows/columns by their integer positions. |
| **Inclusive behavior** | Both start and end labels are **inclusive** when slicing.          | The end index is **exclusive** when slicing (like Python list slicing). |
| **Accepts**            | Row/column labels, boolean arrays, slices with labels.             | Row/column integer positions, boolean arrays, slices with integers.     |
| **Errors**             | Throws `KeyError` if label is not found.                           | Throws `IndexError` if index is out of range.                           |

### drop

### row

In [95]:
sortdf.drop(2)

       A    B   C   D   E
0    654  774  19  33  25
1      3    2  14   2  44
3      0   36  16  17  16
4     28   28  44  27  21
5     24   10  14  46  19
..   ...  ...  ..  ..  ..
329   30   41  33  28  46
330   28   43  14   2  40
331   29   49  30  44   7
332   24   26  49  26  20
333   47   33  46  15  43

[333 rows x 5 columns]

### column

In [96]:
sortdf.drop(['E'],axis=1)

       A    B   C   D
0    654  774  19  33
1      3    2  14   2
2     28   45  44  16
3      0   36  16  17
4     28   28  44  27
..   ...  ...  ..  ..
329   30   41  33  28
330   28   43  14   2
331   29   49  30  44
332   24   26  49  26
333   47   33  46  15

[334 rows x 4 columns]

### Permanently Drop Column

In [97]:
sortdf.drop(['D'],axis=1,inplace=True)

In [98]:
sortdf

       A    B   C   E
0    654  774  19  25
1      3    2  14  44
2     28   45  44  23
3      0   36  16  16
4     28   28  44  21
..   ...  ...  ..  ..
329   30   41  33  46
330   28   43  14  40
331   29   49  30   7
332   24   26  49  20
333   47   33  46  43

[334 rows x 4 columns]

### Permanently Drop Row

In [99]:
sortdf.drop([2,3],axis=0,inplace=True)

In [100]:
sortdf

       A    B   C   E
0    654  774  19  25
1      3    2  14  44
4     28   28  44  21
5     24   10  14  19
6     38   30  40   0
..   ...  ...  ..  ..
329   30   41  33  46
330   28   43  14  40
331   29   49  30   7
332   24   26  49  20
333   47   33  46  43

[332 rows x 4 columns]

### Reset Rows

In [101]:
sortdf.reset_index() #adds an extra index

     index    A    B   C   E
0        0  654  774  19  25
1        1    3    2  14  44
2        4   28   28  44  21
3        5   24   10  14  19
4        6   38   30  40   0
..     ...  ...  ...  ..  ..
327    329   30   41  33  46
328    330   28   43  14  40
329    331   29   49  30   7
330    332   24   26  49  20
331    333   47   33  46  43

[332 rows x 5 columns]

In [102]:
sortdf.reset_index(drop=True)#drops the extra index

       A    B   C   E
0    654  774  19  25
1      3    2  14  44
2     28   28  44  21
3     24   10  14  19
4     38   30  40   0
..   ...  ...  ..  ..
327   30   41  33  46
328   28   43  14  40
329   29   49  30   7
330   24   26  49  20
331   47   33  46  43

[332 rows x 4 columns]

### Null

In [103]:
sortdf.loc[4]=None

In [104]:
sortdf

         A      B     C     E
0    654.0  774.0  19.0  25.0
1      3.0    2.0  14.0  44.0
4      NaN    NaN   NaN   NaN
5     24.0   10.0  14.0  19.0
6     38.0   30.0  40.0   0.0
..     ...    ...   ...   ...
329   30.0   41.0  33.0  46.0
330   28.0   43.0  14.0  40.0
331   29.0   49.0  30.0   7.0
332   24.0   26.0  49.0  20.0
333   47.0   33.0  46.0  43.0

[332 rows x 4 columns]

In [105]:
sortdf.loc[4].isnull() #check

A    True
B    True
C    True
E    True
Name: 4, dtype: bool

# TRAIN

In [106]:
df=pd.read_csv("train.csv")

In [107]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [108]:
df.head() #first 5

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [109]:
df.head(20) #first 20

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [110]:
df [['Name']]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

In [111]:
df [['Name', 'Age']]

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [112]:
filter_df=df[(df['Age']>60)] #should rename before filter to keep the orginial data

In [113]:
filter_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
545,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S
555,556,0,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
625,626,0,1,"Sutton, Mr. Frederick",male,61.0,0,0,36963,32.3208,D50,S
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [114]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [115]:
filter_df=df[ (df['Age']>60) & (df['Sex']=='female') ]

In [116]:
filter_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [117]:
df.shape

(891, 12)

In [118]:
df.loc[200:210]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
200,201,0,3,"Vande Walle, Mr. Nestor Cyriel",male,28.0,0,0,345770,9.5000,NaN,S
201,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.5500,NaN,S
202,203,0,3,"Johanson, Mr. Jakob Alfred",male,34.0,0,0,3101264,6.4958,NaN,S
203,204,0,3,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C
204,205,1,3,"Cohen, Mr. Gurshon ""Gus""",male,18.0,0,0,A/5 3540,8.0500,NaN,S
205,206,0,3,"Strom, Miss. Telma Matilda",female,2.0,0,1,347054,10.4625,G6,S
206,207,0,3,"Backstrom, Mr. Karl Alfred",male,32.0,1,0,3101278,15.8500,NaN,S
207,208,1,3,"Albimona, Mr. Nassef Cassem",male,26.0,0,0,2699,18.7875,NaN,C
208,209,1,3,"Carr, Miss. Helen ""Ellen""",female,16.0,0,0,367231,7.7500,NaN,Q
209,210,1,1,"Blank, Mr. Henry",male,40.0,0,0,112277,31.0000,A31,C
210,211,0,3,"Ali, Mr. Ahmed",male,24.0,0,0,SOTON/O.Q. 3101311,7.0500,NaN,S

In [119]:
df.loc[200:210,['Name','Sex']]

                               Name     Sex
200  Vande Walle, Mr. Nestor Cyriel    male
201             Sage, Mr. Frederick    male
202      Johanson, Mr. Jakob Alfred    male
203            Youseff, Mr. Gerious    male
204        Cohen, Mr. Gurshon "Gus"    male
205      Strom, Miss. Telma Matilda  female
206      Backstrom, Mr. Karl Alfred    male
207     Albimona, Mr. Nassef Cassem    male
208       Carr, Miss. Helen "Ellen"  female
209                Blank, Mr. Henry    male
210                  Ali, Mr. Ahmed    male

### Query Parameter

In [120]:
df.query(" Age>60 and Sex=='female' ")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

### unique value

In [121]:
df.groupby("Pclass")['Age'].count()

Pclass
1    186
2    173
3    355
Name: Age, dtype: int64

In [122]:
df.groupby('Pclass')['Survived'].count()

Pclass
1    216
2    184
3    491
Name: Survived, dtype: int64

### missing value

In [123]:
missing_value=df.isnull().sum()

In [124]:
missing_value

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### map

In [125]:
df['Sex_mf']=df['Sex'].map({'male':0,'female':1})

In [126]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_mf
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

### dropna (drop null value)

In [127]:
df=df.dropna(subset=['Embarked'])

In [128]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_mf
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [129]:
missing_value=df.isnull().sum()

In [130]:
missing_value

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
Sex_mf           0
dtype: int64

### drop column

In [131]:
df=df.drop(['Cabin'],axis=1)

In [132]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Sex_mf
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q,0

### fillna(Replace Null Value)

In [133]:
#df['Age']=df['Age'].fillna(df['Age'].mean())
df['Age']=df['Age'].fillna(df['Age'].median())
#df['Age']=df['Age'].fillna(df['Age'].mode())

In [134]:
missing_value=df.isnull().sum()

In [135]:
missing_value

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Sex_mf         0
dtype: int64

In [136]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Sex_mf
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q,0

In [137]:
print(df['Age'].median())
#print(df['Age'].mode())
#print(df['Age'].mean())

28.0

# NAN DATA

### nan // missing value

In [139]:
data=pd.DataFrame(
    {
        'Name': ['Alice','Golam','Sadik',np.nan,'Ethan'],
        'Age': [25,14,np.nan,17,np.nan],
        'Salary':[50000,20000,np.nan,np.nan,np.nan]
        
    }
)

In [140]:
data

    Name   Age   Salary
0  Alice  25.0  50000.0
1  Golam  14.0  20000.0
2  Sadik   NaN      NaN
3    NaN  17.0      NaN
4  Ethan   NaN      NaN

### drop null value//dropna()

In [141]:
data_dropped=data.dropna()

In [142]:
data_dropped

    Name   Age   Salary
0  Alice  25.0  50000.0
1  Golam  14.0  20000.0

### fill vlaue//fillna()

In [146]:
data_filled=data.fillna({
     'Name':'Unknown',
     'Age':data['Age'].mean(),
     'Salary': 20000
    })

In [147]:
data_filled

      Name        Age   Salary
0    Alice  25.000000  50000.0
1    Golam  14.000000  20000.0
2    Sadik  18.666667  20000.0
3  Unknown  17.000000  20000.0
4    Ethan  18.666667  20000.0

### sort //sorted_vlaues(by='*',asecnding=False)

In [154]:
sorted_data= data_filled.sort_values(by='Age',ascending=False)

In [155]:
sorted_data

      Name        Age   Salary
0    Alice  25.000000  50000.0
2    Sadik  18.666667  20000.0
4    Ethan  18.666667  20000.0
3  Unknown  17.000000  20000.0
1    Golam  14.000000  20000.0